app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    # @user = User.new(username: params[:username], email: params[:email], password: params[:password])        #
    @user = User.new(user_params)

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "Oscar "], ["email", "oscar@hotmail.com"], ["updated_at", "2020-01-10 22:51:49.113177"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])
    @user.update(user_params)
    if @user.update(user_params)